/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union PfData {
    pub i: i64,
    pub d: u128,
    pub c: *mut PfContainer,
    pub dd: *mut PfContainer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PfData"][::std::mem::size_of::<PfData>() - 16usize];
    ["Alignment of PfData"][::std::mem::align_of::<PfData>() - 16usize];
    ["Offset of field: PfData::i"][::std::mem::offset_of!(PfData, i) - 0usize];
    ["Offset of field: PfData::d"][::std::mem::offset_of!(PfData, d) - 0usize];
    ["Offset of field: PfData::c"][::std::mem::offset_of!(PfData, c) - 0usize];
    ["Offset of field: PfData::dd"][::std::mem::offset_of!(PfData, dd) - 0usize];
};
impl Default for PfData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct PfContainer {
    pub type_: ::std::os::raw::c_int,
    pub __bindgen_padding_0: u64,
    pub data: PfData,
    pub name: *mut ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PfContainer"][::std::mem::size_of::<PfContainer>() - 48usize];
    ["Alignment of PfContainer"][::std::mem::align_of::<PfContainer>() - 16usize];
    ["Offset of field: PfContainer::type_"][::std::mem::offset_of!(PfContainer, type_) - 0usize];
    ["Offset of field: PfContainer::data"][::std::mem::offset_of!(PfContainer, data) - 16usize];
    ["Offset of field: PfContainer::name"][::std::mem::offset_of!(PfContainer, name) - 32usize];
    ["Offset of field: PfContainer::size"][::std::mem::offset_of!(PfContainer, size) - 40usize];
};
impl Default for PfContainer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkFFTConfiguration {
    pub FFTdim: u64,
    pub size: [u64; 4usize],
    pub platform: *mut cl_platform_id,
    pub device: *mut cl_device_id,
    pub context: *mut cl_context,
    pub userTempBuffer: u64,
    pub bufferNum: u64,
    pub tempBufferNum: u64,
    pub inputBufferNum: u64,
    pub outputBufferNum: u64,
    pub kernelNum: u64,
    pub bufferSize: *mut u64,
    pub tempBufferSize: *mut u64,
    pub inputBufferSize: *mut u64,
    pub outputBufferSize: *mut u64,
    pub kernelSize: *mut u64,
    pub buffer: *mut cl_mem,
    pub tempBuffer: *mut cl_mem,
    pub inputBuffer: *mut cl_mem,
    pub outputBuffer: *mut cl_mem,
    pub kernel: *mut cl_mem,
    pub bufferOffset: u64,
    pub tempBufferOffset: u64,
    pub inputBufferOffset: u64,
    pub outputBufferOffset: u64,
    pub kernelOffset: u64,
    pub specifyOffsetsAtLaunch: u64,
    pub coalescedMemory: u64,
    pub aimThreads: u64,
    pub numSharedBanks: u64,
    pub inverseReturnToInputBuffer: u64,
    pub numberBatches: u64,
    pub useUint64: u64,
    pub omitDimension: [u64; 4usize],
    pub performBandwidthBoost: ::std::os::raw::c_int,
    pub groupedBatch: [u64; 4usize],
    pub doublePrecision: u64,
    pub quadDoubleDoublePrecision: u64,
    pub quadDoubleDoublePrecisionDoubleMemory: u64,
    pub halfPrecision: u64,
    pub halfPrecisionMemoryOnly: u64,
    pub doublePrecisionFloatMemory: u64,
    pub performR2C: u64,
    pub performDCT: u64,
    pub performDST: u64,
    pub disableMergeSequencesR2C: u64,
    pub forceCallbackVersionRealTransforms: u64,
    pub normalize: u64,
    pub disableReorderFourStep: u64,
    pub useLUT: i64,
    pub useLUT_4step: i64,
    pub makeForwardPlanOnly: u64,
    pub makeInversePlanOnly: u64,
    pub bufferStride: [u64; 4usize],
    pub isInputFormatted: u64,
    pub isOutputFormatted: u64,
    pub inputBufferStride: [u64; 4usize],
    pub outputBufferStride: [u64; 4usize],
    pub swapTo2Stage4Step: u64,
    pub swapTo3Stage4Step: u64,
    pub considerAllAxesStrided: u64,
    pub keepShaderCode: u64,
    pub printMemoryLayout: u64,
    pub saveApplicationToString: u64,
    pub loadApplicationFromString: u64,
    pub loadApplicationString: *mut ::std::os::raw::c_void,
    pub disableSetLocale: u64,
    pub fixMaxRadixBluestein: u64,
    pub forceBluesteinSequenceSize: u64,
    pub useCustomBluesteinPaddingPattern: u64,
    pub primeSizes: *mut u64,
    pub paddedSizes: *mut u64,
    pub fixMinRaderPrimeMult: u64,
    pub fixMaxRaderPrimeMult: u64,
    pub fixMinRaderPrimeFFT: u64,
    pub fixMaxRaderPrimeFFT: u64,
    pub performZeropadding: [u64; 4usize],
    pub fft_zeropad_left: [u64; 4usize],
    pub fft_zeropad_right: [u64; 4usize],
    pub frequencyZeroPadding: u64,
    pub performConvolution: u64,
    pub conjugateConvolution: u64,
    pub crossPowerSpectrumNormalization: u64,
    pub coordinateFeatures: u64,
    pub matrixConvolution: u64,
    pub symmetricKernel: u64,
    pub numberKernels: u64,
    pub kernelConvolution: u64,
    pub registerBoost: u64,
    pub registerBoostNonPow2: u64,
    pub registerBoost4Step: u64,
    pub devicePageSize: u64,
    pub localPageSize: u64,
    pub computeCapabilityMajor: u64,
    pub computeCapabilityMinor: u64,
    pub maxComputeWorkGroupCount: [u64; 4usize],
    pub maxComputeWorkGroupSize: [u64; 4usize],
    pub maxThreadsNum: u64,
    pub sharedMemorySizeStatic: u64,
    pub sharedMemorySize: u64,
    pub sharedMemorySizePow2: u64,
    pub warpSize: u64,
    pub halfThreads: u64,
    pub allocateTempBuffer: u64,
    pub reorderFourStep: u64,
    pub maxCodeLength: i64,
    pub maxTempLength: i64,
    pub autoCustomBluesteinPaddingPattern: u64,
    pub useRaderUintLUT: u64,
    pub vendorID: u64,
    pub commandQueue: *mut cl_command_queue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTConfiguration"][::std::mem::size_of::<VkFFTConfiguration>() - 1152usize];
    ["Alignment of VkFFTConfiguration"][::std::mem::align_of::<VkFFTConfiguration>() - 8usize];
    ["Offset of field: VkFFTConfiguration::FFTdim"]
        [::std::mem::offset_of!(VkFFTConfiguration, FFTdim) - 0usize];
    ["Offset of field: VkFFTConfiguration::size"]
        [::std::mem::offset_of!(VkFFTConfiguration, size) - 8usize];
    ["Offset of field: VkFFTConfiguration::platform"]
        [::std::mem::offset_of!(VkFFTConfiguration, platform) - 40usize];
    ["Offset of field: VkFFTConfiguration::device"]
        [::std::mem::offset_of!(VkFFTConfiguration, device) - 48usize];
    ["Offset of field: VkFFTConfiguration::context"]
        [::std::mem::offset_of!(VkFFTConfiguration, context) - 56usize];
    ["Offset of field: VkFFTConfiguration::userTempBuffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, userTempBuffer) - 64usize];
    ["Offset of field: VkFFTConfiguration::bufferNum"]
        [::std::mem::offset_of!(VkFFTConfiguration, bufferNum) - 72usize];
    ["Offset of field: VkFFTConfiguration::tempBufferNum"]
        [::std::mem::offset_of!(VkFFTConfiguration, tempBufferNum) - 80usize];
    ["Offset of field: VkFFTConfiguration::inputBufferNum"]
        [::std::mem::offset_of!(VkFFTConfiguration, inputBufferNum) - 88usize];
    ["Offset of field: VkFFTConfiguration::outputBufferNum"]
        [::std::mem::offset_of!(VkFFTConfiguration, outputBufferNum) - 96usize];
    ["Offset of field: VkFFTConfiguration::kernelNum"]
        [::std::mem::offset_of!(VkFFTConfiguration, kernelNum) - 104usize];
    ["Offset of field: VkFFTConfiguration::bufferSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, bufferSize) - 112usize];
    ["Offset of field: VkFFTConfiguration::tempBufferSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, tempBufferSize) - 120usize];
    ["Offset of field: VkFFTConfiguration::inputBufferSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, inputBufferSize) - 128usize];
    ["Offset of field: VkFFTConfiguration::outputBufferSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, outputBufferSize) - 136usize];
    ["Offset of field: VkFFTConfiguration::kernelSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, kernelSize) - 144usize];
    ["Offset of field: VkFFTConfiguration::buffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, buffer) - 152usize];
    ["Offset of field: VkFFTConfiguration::tempBuffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, tempBuffer) - 160usize];
    ["Offset of field: VkFFTConfiguration::inputBuffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, inputBuffer) - 168usize];
    ["Offset of field: VkFFTConfiguration::outputBuffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, outputBuffer) - 176usize];
    ["Offset of field: VkFFTConfiguration::kernel"]
        [::std::mem::offset_of!(VkFFTConfiguration, kernel) - 184usize];
    ["Offset of field: VkFFTConfiguration::bufferOffset"]
        [::std::mem::offset_of!(VkFFTConfiguration, bufferOffset) - 192usize];
    ["Offset of field: VkFFTConfiguration::tempBufferOffset"]
        [::std::mem::offset_of!(VkFFTConfiguration, tempBufferOffset) - 200usize];
    ["Offset of field: VkFFTConfiguration::inputBufferOffset"]
        [::std::mem::offset_of!(VkFFTConfiguration, inputBufferOffset) - 208usize];
    ["Offset of field: VkFFTConfiguration::outputBufferOffset"]
        [::std::mem::offset_of!(VkFFTConfiguration, outputBufferOffset) - 216usize];
    ["Offset of field: VkFFTConfiguration::kernelOffset"]
        [::std::mem::offset_of!(VkFFTConfiguration, kernelOffset) - 224usize];
    ["Offset of field: VkFFTConfiguration::specifyOffsetsAtLaunch"]
        [::std::mem::offset_of!(VkFFTConfiguration, specifyOffsetsAtLaunch) - 232usize];
    ["Offset of field: VkFFTConfiguration::coalescedMemory"]
        [::std::mem::offset_of!(VkFFTConfiguration, coalescedMemory) - 240usize];
    ["Offset of field: VkFFTConfiguration::aimThreads"]
        [::std::mem::offset_of!(VkFFTConfiguration, aimThreads) - 248usize];
    ["Offset of field: VkFFTConfiguration::numSharedBanks"]
        [::std::mem::offset_of!(VkFFTConfiguration, numSharedBanks) - 256usize];
    ["Offset of field: VkFFTConfiguration::inverseReturnToInputBuffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, inverseReturnToInputBuffer) - 264usize];
    ["Offset of field: VkFFTConfiguration::numberBatches"]
        [::std::mem::offset_of!(VkFFTConfiguration, numberBatches) - 272usize];
    ["Offset of field: VkFFTConfiguration::useUint64"]
        [::std::mem::offset_of!(VkFFTConfiguration, useUint64) - 280usize];
    ["Offset of field: VkFFTConfiguration::omitDimension"]
        [::std::mem::offset_of!(VkFFTConfiguration, omitDimension) - 288usize];
    ["Offset of field: VkFFTConfiguration::performBandwidthBoost"]
        [::std::mem::offset_of!(VkFFTConfiguration, performBandwidthBoost) - 320usize];
    ["Offset of field: VkFFTConfiguration::groupedBatch"]
        [::std::mem::offset_of!(VkFFTConfiguration, groupedBatch) - 328usize];
    ["Offset of field: VkFFTConfiguration::doublePrecision"]
        [::std::mem::offset_of!(VkFFTConfiguration, doublePrecision) - 360usize];
    ["Offset of field: VkFFTConfiguration::quadDoubleDoublePrecision"]
        [::std::mem::offset_of!(VkFFTConfiguration, quadDoubleDoublePrecision) - 368usize];
    ["Offset of field: VkFFTConfiguration::quadDoubleDoublePrecisionDoubleMemory"][::std::mem::offset_of!(
        VkFFTConfiguration,
        quadDoubleDoublePrecisionDoubleMemory
    ) - 376usize];
    ["Offset of field: VkFFTConfiguration::halfPrecision"]
        [::std::mem::offset_of!(VkFFTConfiguration, halfPrecision) - 384usize];
    ["Offset of field: VkFFTConfiguration::halfPrecisionMemoryOnly"]
        [::std::mem::offset_of!(VkFFTConfiguration, halfPrecisionMemoryOnly) - 392usize];
    ["Offset of field: VkFFTConfiguration::doublePrecisionFloatMemory"]
        [::std::mem::offset_of!(VkFFTConfiguration, doublePrecisionFloatMemory) - 400usize];
    ["Offset of field: VkFFTConfiguration::performR2C"]
        [::std::mem::offset_of!(VkFFTConfiguration, performR2C) - 408usize];
    ["Offset of field: VkFFTConfiguration::performDCT"]
        [::std::mem::offset_of!(VkFFTConfiguration, performDCT) - 416usize];
    ["Offset of field: VkFFTConfiguration::performDST"]
        [::std::mem::offset_of!(VkFFTConfiguration, performDST) - 424usize];
    ["Offset of field: VkFFTConfiguration::disableMergeSequencesR2C"]
        [::std::mem::offset_of!(VkFFTConfiguration, disableMergeSequencesR2C) - 432usize];
    ["Offset of field: VkFFTConfiguration::forceCallbackVersionRealTransforms"]
        [::std::mem::offset_of!(VkFFTConfiguration, forceCallbackVersionRealTransforms) - 440usize];
    ["Offset of field: VkFFTConfiguration::normalize"]
        [::std::mem::offset_of!(VkFFTConfiguration, normalize) - 448usize];
    ["Offset of field: VkFFTConfiguration::disableReorderFourStep"]
        [::std::mem::offset_of!(VkFFTConfiguration, disableReorderFourStep) - 456usize];
    ["Offset of field: VkFFTConfiguration::useLUT"]
        [::std::mem::offset_of!(VkFFTConfiguration, useLUT) - 464usize];
    ["Offset of field: VkFFTConfiguration::useLUT_4step"]
        [::std::mem::offset_of!(VkFFTConfiguration, useLUT_4step) - 472usize];
    ["Offset of field: VkFFTConfiguration::makeForwardPlanOnly"]
        [::std::mem::offset_of!(VkFFTConfiguration, makeForwardPlanOnly) - 480usize];
    ["Offset of field: VkFFTConfiguration::makeInversePlanOnly"]
        [::std::mem::offset_of!(VkFFTConfiguration, makeInversePlanOnly) - 488usize];
    ["Offset of field: VkFFTConfiguration::bufferStride"]
        [::std::mem::offset_of!(VkFFTConfiguration, bufferStride) - 496usize];
    ["Offset of field: VkFFTConfiguration::isInputFormatted"]
        [::std::mem::offset_of!(VkFFTConfiguration, isInputFormatted) - 528usize];
    ["Offset of field: VkFFTConfiguration::isOutputFormatted"]
        [::std::mem::offset_of!(VkFFTConfiguration, isOutputFormatted) - 536usize];
    ["Offset of field: VkFFTConfiguration::inputBufferStride"]
        [::std::mem::offset_of!(VkFFTConfiguration, inputBufferStride) - 544usize];
    ["Offset of field: VkFFTConfiguration::outputBufferStride"]
        [::std::mem::offset_of!(VkFFTConfiguration, outputBufferStride) - 576usize];
    ["Offset of field: VkFFTConfiguration::swapTo2Stage4Step"]
        [::std::mem::offset_of!(VkFFTConfiguration, swapTo2Stage4Step) - 608usize];
    ["Offset of field: VkFFTConfiguration::swapTo3Stage4Step"]
        [::std::mem::offset_of!(VkFFTConfiguration, swapTo3Stage4Step) - 616usize];
    ["Offset of field: VkFFTConfiguration::considerAllAxesStrided"]
        [::std::mem::offset_of!(VkFFTConfiguration, considerAllAxesStrided) - 624usize];
    ["Offset of field: VkFFTConfiguration::keepShaderCode"]
        [::std::mem::offset_of!(VkFFTConfiguration, keepShaderCode) - 632usize];
    ["Offset of field: VkFFTConfiguration::printMemoryLayout"]
        [::std::mem::offset_of!(VkFFTConfiguration, printMemoryLayout) - 640usize];
    ["Offset of field: VkFFTConfiguration::saveApplicationToString"]
        [::std::mem::offset_of!(VkFFTConfiguration, saveApplicationToString) - 648usize];
    ["Offset of field: VkFFTConfiguration::loadApplicationFromString"]
        [::std::mem::offset_of!(VkFFTConfiguration, loadApplicationFromString) - 656usize];
    ["Offset of field: VkFFTConfiguration::loadApplicationString"]
        [::std::mem::offset_of!(VkFFTConfiguration, loadApplicationString) - 664usize];
    ["Offset of field: VkFFTConfiguration::disableSetLocale"]
        [::std::mem::offset_of!(VkFFTConfiguration, disableSetLocale) - 672usize];
    ["Offset of field: VkFFTConfiguration::fixMaxRadixBluestein"]
        [::std::mem::offset_of!(VkFFTConfiguration, fixMaxRadixBluestein) - 680usize];
    ["Offset of field: VkFFTConfiguration::forceBluesteinSequenceSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, forceBluesteinSequenceSize) - 688usize];
    ["Offset of field: VkFFTConfiguration::useCustomBluesteinPaddingPattern"]
        [::std::mem::offset_of!(VkFFTConfiguration, useCustomBluesteinPaddingPattern) - 696usize];
    ["Offset of field: VkFFTConfiguration::primeSizes"]
        [::std::mem::offset_of!(VkFFTConfiguration, primeSizes) - 704usize];
    ["Offset of field: VkFFTConfiguration::paddedSizes"]
        [::std::mem::offset_of!(VkFFTConfiguration, paddedSizes) - 712usize];
    ["Offset of field: VkFFTConfiguration::fixMinRaderPrimeMult"]
        [::std::mem::offset_of!(VkFFTConfiguration, fixMinRaderPrimeMult) - 720usize];
    ["Offset of field: VkFFTConfiguration::fixMaxRaderPrimeMult"]
        [::std::mem::offset_of!(VkFFTConfiguration, fixMaxRaderPrimeMult) - 728usize];
    ["Offset of field: VkFFTConfiguration::fixMinRaderPrimeFFT"]
        [::std::mem::offset_of!(VkFFTConfiguration, fixMinRaderPrimeFFT) - 736usize];
    ["Offset of field: VkFFTConfiguration::fixMaxRaderPrimeFFT"]
        [::std::mem::offset_of!(VkFFTConfiguration, fixMaxRaderPrimeFFT) - 744usize];
    ["Offset of field: VkFFTConfiguration::performZeropadding"]
        [::std::mem::offset_of!(VkFFTConfiguration, performZeropadding) - 752usize];
    ["Offset of field: VkFFTConfiguration::fft_zeropad_left"]
        [::std::mem::offset_of!(VkFFTConfiguration, fft_zeropad_left) - 784usize];
    ["Offset of field: VkFFTConfiguration::fft_zeropad_right"]
        [::std::mem::offset_of!(VkFFTConfiguration, fft_zeropad_right) - 816usize];
    ["Offset of field: VkFFTConfiguration::frequencyZeroPadding"]
        [::std::mem::offset_of!(VkFFTConfiguration, frequencyZeroPadding) - 848usize];
    ["Offset of field: VkFFTConfiguration::performConvolution"]
        [::std::mem::offset_of!(VkFFTConfiguration, performConvolution) - 856usize];
    ["Offset of field: VkFFTConfiguration::conjugateConvolution"]
        [::std::mem::offset_of!(VkFFTConfiguration, conjugateConvolution) - 864usize];
    ["Offset of field: VkFFTConfiguration::crossPowerSpectrumNormalization"]
        [::std::mem::offset_of!(VkFFTConfiguration, crossPowerSpectrumNormalization) - 872usize];
    ["Offset of field: VkFFTConfiguration::coordinateFeatures"]
        [::std::mem::offset_of!(VkFFTConfiguration, coordinateFeatures) - 880usize];
    ["Offset of field: VkFFTConfiguration::matrixConvolution"]
        [::std::mem::offset_of!(VkFFTConfiguration, matrixConvolution) - 888usize];
    ["Offset of field: VkFFTConfiguration::symmetricKernel"]
        [::std::mem::offset_of!(VkFFTConfiguration, symmetricKernel) - 896usize];
    ["Offset of field: VkFFTConfiguration::numberKernels"]
        [::std::mem::offset_of!(VkFFTConfiguration, numberKernels) - 904usize];
    ["Offset of field: VkFFTConfiguration::kernelConvolution"]
        [::std::mem::offset_of!(VkFFTConfiguration, kernelConvolution) - 912usize];
    ["Offset of field: VkFFTConfiguration::registerBoost"]
        [::std::mem::offset_of!(VkFFTConfiguration, registerBoost) - 920usize];
    ["Offset of field: VkFFTConfiguration::registerBoostNonPow2"]
        [::std::mem::offset_of!(VkFFTConfiguration, registerBoostNonPow2) - 928usize];
    ["Offset of field: VkFFTConfiguration::registerBoost4Step"]
        [::std::mem::offset_of!(VkFFTConfiguration, registerBoost4Step) - 936usize];
    ["Offset of field: VkFFTConfiguration::devicePageSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, devicePageSize) - 944usize];
    ["Offset of field: VkFFTConfiguration::localPageSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, localPageSize) - 952usize];
    ["Offset of field: VkFFTConfiguration::computeCapabilityMajor"]
        [::std::mem::offset_of!(VkFFTConfiguration, computeCapabilityMajor) - 960usize];
    ["Offset of field: VkFFTConfiguration::computeCapabilityMinor"]
        [::std::mem::offset_of!(VkFFTConfiguration, computeCapabilityMinor) - 968usize];
    ["Offset of field: VkFFTConfiguration::maxComputeWorkGroupCount"]
        [::std::mem::offset_of!(VkFFTConfiguration, maxComputeWorkGroupCount) - 976usize];
    ["Offset of field: VkFFTConfiguration::maxComputeWorkGroupSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, maxComputeWorkGroupSize) - 1008usize];
    ["Offset of field: VkFFTConfiguration::maxThreadsNum"]
        [::std::mem::offset_of!(VkFFTConfiguration, maxThreadsNum) - 1040usize];
    ["Offset of field: VkFFTConfiguration::sharedMemorySizeStatic"]
        [::std::mem::offset_of!(VkFFTConfiguration, sharedMemorySizeStatic) - 1048usize];
    ["Offset of field: VkFFTConfiguration::sharedMemorySize"]
        [::std::mem::offset_of!(VkFFTConfiguration, sharedMemorySize) - 1056usize];
    ["Offset of field: VkFFTConfiguration::sharedMemorySizePow2"]
        [::std::mem::offset_of!(VkFFTConfiguration, sharedMemorySizePow2) - 1064usize];
    ["Offset of field: VkFFTConfiguration::warpSize"]
        [::std::mem::offset_of!(VkFFTConfiguration, warpSize) - 1072usize];
    ["Offset of field: VkFFTConfiguration::halfThreads"]
        [::std::mem::offset_of!(VkFFTConfiguration, halfThreads) - 1080usize];
    ["Offset of field: VkFFTConfiguration::allocateTempBuffer"]
        [::std::mem::offset_of!(VkFFTConfiguration, allocateTempBuffer) - 1088usize];
    ["Offset of field: VkFFTConfiguration::reorderFourStep"]
        [::std::mem::offset_of!(VkFFTConfiguration, reorderFourStep) - 1096usize];
    ["Offset of field: VkFFTConfiguration::maxCodeLength"]
        [::std::mem::offset_of!(VkFFTConfiguration, maxCodeLength) - 1104usize];
    ["Offset of field: VkFFTConfiguration::maxTempLength"]
        [::std::mem::offset_of!(VkFFTConfiguration, maxTempLength) - 1112usize];
    ["Offset of field: VkFFTConfiguration::autoCustomBluesteinPaddingPattern"]
        [::std::mem::offset_of!(VkFFTConfiguration, autoCustomBluesteinPaddingPattern) - 1120usize];
    ["Offset of field: VkFFTConfiguration::useRaderUintLUT"]
        [::std::mem::offset_of!(VkFFTConfiguration, useRaderUintLUT) - 1128usize];
    ["Offset of field: VkFFTConfiguration::vendorID"]
        [::std::mem::offset_of!(VkFFTConfiguration, vendorID) - 1136usize];
    ["Offset of field: VkFFTConfiguration::commandQueue"]
        [::std::mem::offset_of!(VkFFTConfiguration, commandQueue) - 1144usize];
};
impl Default for VkFFTConfiguration {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkFFTLaunchParams {
    pub commandQueue: *mut cl_command_queue,
    pub buffer: *mut cl_mem,
    pub tempBuffer: *mut cl_mem,
    pub inputBuffer: *mut cl_mem,
    pub outputBuffer: *mut cl_mem,
    pub kernel: *mut cl_mem,
    pub bufferOffset: u64,
    pub tempBufferOffset: u64,
    pub inputBufferOffset: u64,
    pub outputBufferOffset: u64,
    pub kernelOffset: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTLaunchParams"][::std::mem::size_of::<VkFFTLaunchParams>() - 88usize];
    ["Alignment of VkFFTLaunchParams"][::std::mem::align_of::<VkFFTLaunchParams>() - 8usize];
    ["Offset of field: VkFFTLaunchParams::commandQueue"]
        [::std::mem::offset_of!(VkFFTLaunchParams, commandQueue) - 0usize];
    ["Offset of field: VkFFTLaunchParams::buffer"]
        [::std::mem::offset_of!(VkFFTLaunchParams, buffer) - 8usize];
    ["Offset of field: VkFFTLaunchParams::tempBuffer"]
        [::std::mem::offset_of!(VkFFTLaunchParams, tempBuffer) - 16usize];
    ["Offset of field: VkFFTLaunchParams::inputBuffer"]
        [::std::mem::offset_of!(VkFFTLaunchParams, inputBuffer) - 24usize];
    ["Offset of field: VkFFTLaunchParams::outputBuffer"]
        [::std::mem::offset_of!(VkFFTLaunchParams, outputBuffer) - 32usize];
    ["Offset of field: VkFFTLaunchParams::kernel"]
        [::std::mem::offset_of!(VkFFTLaunchParams, kernel) - 40usize];
    ["Offset of field: VkFFTLaunchParams::bufferOffset"]
        [::std::mem::offset_of!(VkFFTLaunchParams, bufferOffset) - 48usize];
    ["Offset of field: VkFFTLaunchParams::tempBufferOffset"]
        [::std::mem::offset_of!(VkFFTLaunchParams, tempBufferOffset) - 56usize];
    ["Offset of field: VkFFTLaunchParams::inputBufferOffset"]
        [::std::mem::offset_of!(VkFFTLaunchParams, inputBufferOffset) - 64usize];
    ["Offset of field: VkFFTLaunchParams::outputBufferOffset"]
        [::std::mem::offset_of!(VkFFTLaunchParams, outputBufferOffset) - 72usize];
    ["Offset of field: VkFFTLaunchParams::kernelOffset"]
        [::std::mem::offset_of!(VkFFTLaunchParams, kernelOffset) - 80usize];
};
impl Default for VkFFTLaunchParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const VkFFTResult_VKFFT_SUCCESS: VkFFTResult = 0;
pub const VkFFTResult_VKFFT_ERROR_MALLOC_FAILED: VkFFTResult = 1;
pub const VkFFTResult_VKFFT_ERROR_INSUFFICIENT_CODE_BUFFER: VkFFTResult = 2;
pub const VkFFTResult_VKFFT_ERROR_INSUFFICIENT_TEMP_BUFFER: VkFFTResult = 3;
pub const VkFFTResult_VKFFT_ERROR_PLAN_NOT_INITIALIZED: VkFFTResult = 4;
pub const VkFFTResult_VKFFT_ERROR_NULL_TEMP_PASSED: VkFFTResult = 5;
pub const VkFFTResult_VKFFT_ERROR_MATH_FAILED: VkFFTResult = 6;
pub const VkFFTResult_VKFFT_ERROR_FFTdim_GT_MAX_FFT_DIMENSIONS: VkFFTResult = 7;
pub const VkFFTResult_VKFFT_ERROR_NONZERO_APP_INITIALIZATION: VkFFTResult = 8;
pub const VkFFTResult_VKFFT_ERROR_INVALID_PHYSICAL_DEVICE: VkFFTResult = 1001;
pub const VkFFTResult_VKFFT_ERROR_INVALID_DEVICE: VkFFTResult = 1002;
pub const VkFFTResult_VKFFT_ERROR_INVALID_QUEUE: VkFFTResult = 1003;
pub const VkFFTResult_VKFFT_ERROR_INVALID_COMMAND_POOL: VkFFTResult = 1004;
pub const VkFFTResult_VKFFT_ERROR_INVALID_FENCE: VkFFTResult = 1005;
pub const VkFFTResult_VKFFT_ERROR_ONLY_FORWARD_FFT_INITIALIZED: VkFFTResult = 1006;
pub const VkFFTResult_VKFFT_ERROR_ONLY_INVERSE_FFT_INITIALIZED: VkFFTResult = 1007;
pub const VkFFTResult_VKFFT_ERROR_INVALID_CONTEXT: VkFFTResult = 1008;
pub const VkFFTResult_VKFFT_ERROR_INVALID_PLATFORM: VkFFTResult = 1009;
pub const VkFFTResult_VKFFT_ERROR_ENABLED_saveApplicationToString: VkFFTResult = 1010;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_FILE: VkFFTResult = 1011;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_FFTdim: VkFFTResult = 2001;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_size: VkFFTResult = 2002;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_bufferSize: VkFFTResult = 2003;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_buffer: VkFFTResult = 2004;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_tempBufferSize: VkFFTResult = 2005;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_tempBuffer: VkFFTResult = 2006;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_inputBufferSize: VkFFTResult = 2007;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_inputBuffer: VkFFTResult = 2008;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_outputBufferSize: VkFFTResult = 2009;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_outputBuffer: VkFFTResult = 2010;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_kernelSize: VkFFTResult = 2011;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_kernel: VkFFTResult = 2012;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_applicationString: VkFFTResult = 2013;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_useCustomBluesteinPaddingPattern_arrays: VkFFTResult = 2014;
pub const VkFFTResult_VKFFT_ERROR_EMPTY_app: VkFFTResult = 2015;
pub const VkFFTResult_VKFFT_ERROR_INVALID_user_tempBuffer_too_small: VkFFTResult = 2016;
pub const VkFFTResult_VKFFT_ERROR_UNSUPPORTED_RADIX: VkFFTResult = 3001;
pub const VkFFTResult_VKFFT_ERROR_UNSUPPORTED_FFT_LENGTH: VkFFTResult = 3002;
pub const VkFFTResult_VKFFT_ERROR_UNSUPPORTED_FFT_LENGTH_R2C: VkFFTResult = 3003;
pub const VkFFTResult_VKFFT_ERROR_UNSUPPORTED_FFT_LENGTH_R2R: VkFFTResult = 3004;
pub const VkFFTResult_VKFFT_ERROR_UNSUPPORTED_FFT_OMIT: VkFFTResult = 3005;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_ALLOCATE: VkFFTResult = 4001;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_MAP_MEMORY: VkFFTResult = 4002;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_ALLOCATE_COMMAND_BUFFERS: VkFFTResult = 4003;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_BEGIN_COMMAND_BUFFER: VkFFTResult = 4004;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_END_COMMAND_BUFFER: VkFFTResult = 4005;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SUBMIT_QUEUE: VkFFTResult = 4006;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_WAIT_FOR_FENCES: VkFFTResult = 4007;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_RESET_FENCES: VkFFTResult = 4008;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_DESCRIPTOR_POOL: VkFFTResult = 4009;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_DESCRIPTOR_SET_LAYOUT: VkFFTResult = 4010;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_ALLOCATE_DESCRIPTOR_SETS: VkFFTResult = 4011;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_PIPELINE_LAYOUT: VkFFTResult = 4012;
pub const VkFFTResult_VKFFT_ERROR_FAILED_SHADER_PREPROCESS: VkFFTResult = 4013;
pub const VkFFTResult_VKFFT_ERROR_FAILED_SHADER_PARSE: VkFFTResult = 4014;
pub const VkFFTResult_VKFFT_ERROR_FAILED_SHADER_LINK: VkFFTResult = 4015;
pub const VkFFTResult_VKFFT_ERROR_FAILED_SPIRV_GENERATE: VkFFTResult = 4016;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_SHADER_MODULE: VkFFTResult = 4017;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_INSTANCE: VkFFTResult = 4018;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SETUP_DEBUG_MESSENGER: VkFFTResult = 4019;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_FIND_PHYSICAL_DEVICE: VkFFTResult = 4020;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_DEVICE: VkFFTResult = 4021;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_FENCE: VkFFTResult = 4022;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_COMMAND_POOL: VkFFTResult = 4023;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_BUFFER: VkFFTResult = 4024;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_ALLOCATE_MEMORY: VkFFTResult = 4025;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_BIND_BUFFER_MEMORY: VkFFTResult = 4026;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_FIND_MEMORY: VkFFTResult = 4027;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SYNCHRONIZE: VkFFTResult = 4028;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_COPY: VkFFTResult = 4029;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_PROGRAM: VkFFTResult = 4030;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_COMPILE_PROGRAM: VkFFTResult = 4031;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_GET_CODE_SIZE: VkFFTResult = 4032;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_GET_CODE: VkFFTResult = 4033;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_DESTROY_PROGRAM: VkFFTResult = 4034;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_LOAD_MODULE: VkFFTResult = 4035;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_GET_FUNCTION: VkFFTResult = 4036;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SET_DYNAMIC_SHARED_MEMORY: VkFFTResult = 4037;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_MODULE_GET_GLOBAL: VkFFTResult = 4038;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_LAUNCH_KERNEL: VkFFTResult = 4039;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_EVENT_RECORD: VkFFTResult = 4040;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_ADD_NAME_EXPRESSION: VkFFTResult = 4041;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_INITIALIZE: VkFFTResult = 4042;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SET_DEVICE_ID: VkFFTResult = 4043;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_GET_DEVICE: VkFFTResult = 4044;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_CONTEXT: VkFFTResult = 4045;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_PIPELINE: VkFFTResult = 4046;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SET_KERNEL_ARG: VkFFTResult = 4047;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_COMMAND_QUEUE: VkFFTResult = 4048;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_RELEASE_COMMAND_QUEUE: VkFFTResult = 4049;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_ENUMERATE_DEVICES: VkFFTResult = 4050;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_GET_ATTRIBUTE: VkFFTResult = 4051;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_EVENT: VkFFTResult = 4052;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_CREATE_COMMAND_LIST: VkFFTResult = 4053;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_DESTROY_COMMAND_LIST: VkFFTResult = 4054;
pub const VkFFTResult_VKFFT_ERROR_FAILED_TO_SUBMIT_BARRIER: VkFFTResult = 4055;
pub type VkFFTResult = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct VkFFTRaderContainer {
    pub prime: ::std::os::raw::c_int,
    pub generator: ::std::os::raw::c_int,
    pub multiplier: ::std::os::raw::c_int,
    pub inline_rader_g_pow: ::std::os::raw::c_int,
    pub raderUintLUToffset: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub raderRegisters: ::std::os::raw::c_int,
    pub rader_min_registers: ::std::os::raw::c_int,
    pub registers_per_thread: ::std::os::raw::c_int,
    pub min_registers_per_thread: ::std::os::raw::c_int,
    pub loc_multipliers: [::std::os::raw::c_int; 33usize],
    pub registers_per_thread_per_radix: [::std::os::raw::c_int; 33usize],
    pub stageRadix: [::std::os::raw::c_int; 20usize],
    pub numStages: ::std::os::raw::c_int,
    pub numSubPrimes: ::std::os::raw::c_int,
    pub stage_rader_generator: [::std::os::raw::c_int; 20usize],
    pub containerFFTDim: ::std::os::raw::c_int,
    pub containerFFTNum: ::std::os::raw::c_int,
    pub subLogicalGroupSizeMax: ::std::os::raw::c_int,
    pub RaderKernelOffsetLUT: i64,
    pub RaderRadixOffsetLUT: i64,
    pub RaderRadixOffsetLUTiFFT: i64,
    pub g_powConstantStruct: PfContainer,
    pub r_rader_kernelConstantStruct: PfContainer,
    pub i_rader_kernelConstantStruct: PfContainer,
    pub raderFFTkernel: *mut ::std::os::raw::c_void,
    pub container: *mut VkFFTRaderContainer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTRaderContainer"][::std::mem::size_of::<VkFFTRaderContainer>() - 672usize];
    ["Alignment of VkFFTRaderContainer"][::std::mem::align_of::<VkFFTRaderContainer>() - 16usize];
    ["Offset of field: VkFFTRaderContainer::prime"]
        [::std::mem::offset_of!(VkFFTRaderContainer, prime) - 0usize];
    ["Offset of field: VkFFTRaderContainer::generator"]
        [::std::mem::offset_of!(VkFFTRaderContainer, generator) - 4usize];
    ["Offset of field: VkFFTRaderContainer::multiplier"]
        [::std::mem::offset_of!(VkFFTRaderContainer, multiplier) - 8usize];
    ["Offset of field: VkFFTRaderContainer::inline_rader_g_pow"]
        [::std::mem::offset_of!(VkFFTRaderContainer, inline_rader_g_pow) - 12usize];
    ["Offset of field: VkFFTRaderContainer::raderUintLUToffset"]
        [::std::mem::offset_of!(VkFFTRaderContainer, raderUintLUToffset) - 16usize];
    ["Offset of field: VkFFTRaderContainer::type_"]
        [::std::mem::offset_of!(VkFFTRaderContainer, type_) - 20usize];
    ["Offset of field: VkFFTRaderContainer::raderRegisters"]
        [::std::mem::offset_of!(VkFFTRaderContainer, raderRegisters) - 24usize];
    ["Offset of field: VkFFTRaderContainer::rader_min_registers"]
        [::std::mem::offset_of!(VkFFTRaderContainer, rader_min_registers) - 28usize];
    ["Offset of field: VkFFTRaderContainer::registers_per_thread"]
        [::std::mem::offset_of!(VkFFTRaderContainer, registers_per_thread) - 32usize];
    ["Offset of field: VkFFTRaderContainer::min_registers_per_thread"]
        [::std::mem::offset_of!(VkFFTRaderContainer, min_registers_per_thread) - 36usize];
    ["Offset of field: VkFFTRaderContainer::loc_multipliers"]
        [::std::mem::offset_of!(VkFFTRaderContainer, loc_multipliers) - 40usize];
    ["Offset of field: VkFFTRaderContainer::registers_per_thread_per_radix"]
        [::std::mem::offset_of!(VkFFTRaderContainer, registers_per_thread_per_radix) - 172usize];
    ["Offset of field: VkFFTRaderContainer::stageRadix"]
        [::std::mem::offset_of!(VkFFTRaderContainer, stageRadix) - 304usize];
    ["Offset of field: VkFFTRaderContainer::numStages"]
        [::std::mem::offset_of!(VkFFTRaderContainer, numStages) - 384usize];
    ["Offset of field: VkFFTRaderContainer::numSubPrimes"]
        [::std::mem::offset_of!(VkFFTRaderContainer, numSubPrimes) - 388usize];
    ["Offset of field: VkFFTRaderContainer::stage_rader_generator"]
        [::std::mem::offset_of!(VkFFTRaderContainer, stage_rader_generator) - 392usize];
    ["Offset of field: VkFFTRaderContainer::containerFFTDim"]
        [::std::mem::offset_of!(VkFFTRaderContainer, containerFFTDim) - 472usize];
    ["Offset of field: VkFFTRaderContainer::containerFFTNum"]
        [::std::mem::offset_of!(VkFFTRaderContainer, containerFFTNum) - 476usize];
    ["Offset of field: VkFFTRaderContainer::subLogicalGroupSizeMax"]
        [::std::mem::offset_of!(VkFFTRaderContainer, subLogicalGroupSizeMax) - 480usize];
    ["Offset of field: VkFFTRaderContainer::RaderKernelOffsetLUT"]
        [::std::mem::offset_of!(VkFFTRaderContainer, RaderKernelOffsetLUT) - 488usize];
    ["Offset of field: VkFFTRaderContainer::RaderRadixOffsetLUT"]
        [::std::mem::offset_of!(VkFFTRaderContainer, RaderRadixOffsetLUT) - 496usize];
    ["Offset of field: VkFFTRaderContainer::RaderRadixOffsetLUTiFFT"]
        [::std::mem::offset_of!(VkFFTRaderContainer, RaderRadixOffsetLUTiFFT) - 504usize];
    ["Offset of field: VkFFTRaderContainer::g_powConstantStruct"]
        [::std::mem::offset_of!(VkFFTRaderContainer, g_powConstantStruct) - 512usize];
    ["Offset of field: VkFFTRaderContainer::r_rader_kernelConstantStruct"]
        [::std::mem::offset_of!(VkFFTRaderContainer, r_rader_kernelConstantStruct) - 560usize];
    ["Offset of field: VkFFTRaderContainer::i_rader_kernelConstantStruct"]
        [::std::mem::offset_of!(VkFFTRaderContainer, i_rader_kernelConstantStruct) - 608usize];
    ["Offset of field: VkFFTRaderContainer::raderFFTkernel"]
        [::std::mem::offset_of!(VkFFTRaderContainer, raderFFTkernel) - 656usize];
    ["Offset of field: VkFFTRaderContainer::container"]
        [::std::mem::offset_of!(VkFFTRaderContainer, container) - 664usize];
};
impl Default for VkFFTRaderContainer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct VkFFTSpecializationConstantsLayout {
    pub res: VkFFTResult,
    pub __bindgen_padding_0: u64,
    pub double_PI: u128,
    pub numFFTdims: ::std::os::raw::c_int,
    pub __bindgen_padding_1: u64,
    pub size: [PfContainer; 4usize],
    pub localSize: [PfContainer; 3usize],
    pub numSubgroups: ::std::os::raw::c_int,
    pub __bindgen_padding_2: u64,
    pub sourceFFTSize: PfContainer,
    pub fftDim: PfContainer,
    pub precision: ::std::os::raw::c_int,
    pub inverse: ::std::os::raw::c_int,
    pub actualInverse: ::std::os::raw::c_int,
    pub inverseBluestein: ::std::os::raw::c_int,
    pub zeropad: [::std::os::raw::c_int; 2usize],
    pub zeropadBluestein: [::std::os::raw::c_int; 2usize],
    pub axis_id: ::std::os::raw::c_int,
    pub axis_upload_id: ::std::os::raw::c_int,
    pub numAxisUploads: ::std::os::raw::c_int,
    pub registers_per_thread: ::std::os::raw::c_int,
    pub registers_per_thread_per_radix: [::std::os::raw::c_int; 33usize],
    pub min_registers_per_thread: ::std::os::raw::c_int,
    pub maxNonPow2Radix: ::std::os::raw::c_int,
    pub usedLocRegs: ::std::os::raw::c_int,
    pub readToRegisters: ::std::os::raw::c_int,
    pub writeFromRegisters: ::std::os::raw::c_int,
    pub LUT: ::std::os::raw::c_int,
    pub LUT_4step: ::std::os::raw::c_int,
    pub raderUintLUT: ::std::os::raw::c_int,
    pub useCoalescedLUTUploadToSM: ::std::os::raw::c_int,
    pub useBluesteinFFT: ::std::os::raw::c_int,
    pub reverseBluesteinMultiUpload: ::std::os::raw::c_int,
    pub BluesteinConvolutionStep: ::std::os::raw::c_int,
    pub BluesteinPreMultiplication: ::std::os::raw::c_int,
    pub BluesteinPostMultiplication: ::std::os::raw::c_int,
    pub __bindgen_padding_3: [u64; 0usize],
    pub startDCT3LUT: PfContainer,
    pub startDCT4LUT: PfContainer,
    pub performR2C: ::std::os::raw::c_int,
    pub performR2CmultiUpload: ::std::os::raw::c_int,
    pub performR2RmultiUpload: ::std::os::raw::c_int,
    pub performDCT: ::std::os::raw::c_int,
    pub performDST: ::std::os::raw::c_int,
    pub performBandwidthBoost: ::std::os::raw::c_int,
    pub frequencyZeropadding: ::std::os::raw::c_int,
    pub performZeropaddingFull: [::std::os::raw::c_int; 4usize],
    pub performZeropaddingInput: [::std::os::raw::c_int; 4usize],
    pub performZeropaddingOutput: [::std::os::raw::c_int; 4usize],
    pub fft_zeropad_left_full: [PfContainer; 4usize],
    pub fft_zeropad_left_read: [PfContainer; 4usize],
    pub fft_zeropad_left_write: [PfContainer; 4usize],
    pub fft_zeropad_right_full: [PfContainer; 4usize],
    pub fft_zeropad_right_read: [PfContainer; 4usize],
    pub fft_zeropad_right_write: [PfContainer; 4usize],
    pub fft_zeropad_Bluestein_left_read: [PfContainer; 4usize],
    pub fft_zeropad_Bluestein_left_write: [PfContainer; 4usize],
    pub fft_zeropad_Bluestein_right_read: [PfContainer; 4usize],
    pub fft_zeropad_Bluestein_right_write: [PfContainer; 4usize],
    pub inputStride: [PfContainer; 6usize],
    pub outputStride: [PfContainer; 6usize],
    pub fft_dim_full: PfContainer,
    pub stageStartSize: PfContainer,
    pub firstStageStartSize: PfContainer,
    pub fft_dim_x: PfContainer,
    pub dispatchZactualFFTSize: PfContainer,
    pub numStages: ::std::os::raw::c_int,
    pub stageRadix: [::std::os::raw::c_int; 33usize],
    pub __bindgen_padding_4: u64,
    pub inputOffset: PfContainer,
    pub kernelOffset: PfContainer,
    pub outputOffset: PfContainer,
    pub reorderFourStep: ::std::os::raw::c_int,
    pub storeSharedComplexComponentsSeparately: ::std::os::raw::c_int,
    pub pushConstantsStructSize: ::std::os::raw::c_int,
    pub performWorkGroupShift: [::std::os::raw::c_int; 4usize],
    pub performPostCompilationInputOffset: ::std::os::raw::c_int,
    pub performPostCompilationOutputOffset: ::std::os::raw::c_int,
    pub performPostCompilationKernelOffset: ::std::os::raw::c_int,
    pub inputBufferBlockNum: u64,
    pub inputBufferBlockSize: u64,
    pub outputBufferBlockNum: u64,
    pub outputBufferBlockSize: u64,
    pub kernelBlockNum: u64,
    pub kernelBlockSize: u64,
    pub numCoordinates: ::std::os::raw::c_int,
    pub matrixConvolution: ::std::os::raw::c_int,
    pub numBatches: PfContainer,
    pub numKernels: PfContainer,
    pub conjugateConvolution: ::std::os::raw::c_int,
    pub crossPowerSpectrumNormalization: ::std::os::raw::c_int,
    pub __bindgen_padding_5: u64,
    pub usedSharedMemory: PfContainer,
    pub sharedMemSize: ::std::os::raw::c_int,
    pub sharedMemSizePow2: ::std::os::raw::c_int,
    pub normalize: ::std::os::raw::c_int,
    pub complexSize: ::std::os::raw::c_int,
    pub inputNumberByteSize: ::std::os::raw::c_int,
    pub outputNumberByteSize: ::std::os::raw::c_int,
    pub kernelNumberByteSize: ::std::os::raw::c_int,
    pub maxStageSumLUT: ::std::os::raw::c_int,
    pub swapComputeWorkGroupID: ::std::os::raw::c_int,
    pub convolutionStep: ::std::os::raw::c_int,
    pub symmetricKernel: ::std::os::raw::c_int,
    pub supportAxis: ::std::os::raw::c_int,
    pub cacheShuffle: ::std::os::raw::c_int,
    pub registerBoost: ::std::os::raw::c_int,
    pub warpSize: ::std::os::raw::c_int,
    pub numSharedBanks: ::std::os::raw::c_int,
    pub resolveBankConflictFirstStages: ::std::os::raw::c_int,
    pub __bindgen_padding_6: u64,
    pub sharedStrideBankConflictFirstStages: PfContainer,
    pub sharedStrideReadWriteConflict: PfContainer,
    pub sharedStrideRaderFFT: PfContainer,
    pub sharedShiftRaderFFT: PfContainer,
    pub maxSharedStride: PfContainer,
    pub maxSingleSizeStrided: PfContainer,
    pub axisSwapped: ::std::os::raw::c_int,
    pub stridedSharedLayout: ::std::os::raw::c_int,
    pub mergeSequencesR2C: ::std::os::raw::c_int,
    pub forceCallbackVersionRealTransforms: ::std::os::raw::c_int,
    pub numBuffersBound: [::std::os::raw::c_int; 10usize],
    pub convolutionBindingID: ::std::os::raw::c_int,
    pub LUTBindingID: ::std::os::raw::c_int,
    pub BluesteinConvolutionBindingID: ::std::os::raw::c_int,
    pub BluesteinMultiplicationBindingID: ::std::os::raw::c_int,
    pub useRader: ::std::os::raw::c_int,
    pub numRaderPrimes: ::std::os::raw::c_int,
    pub minRaderFFTThreadNum: ::std::os::raw::c_int,
    pub raderContainer: *mut VkFFTRaderContainer,
    pub currentRaderContainer: *mut VkFFTRaderContainer,
    pub RaderUintLUTBindingID: ::std::os::raw::c_int,
    pub useRaderMult: ::std::os::raw::c_int,
    pub additionalRaderSharedSize: PfContainer,
    pub RaderKernelOffsetShared: [PfContainer; 33usize],
    pub RaderKernelOffsetLUT: [PfContainer; 33usize],
    pub rader_generator: [::std::os::raw::c_int; 33usize],
    pub fixMinRaderPrimeMult: ::std::os::raw::c_int,
    pub fixMaxRaderPrimeMult: ::std::os::raw::c_int,
    pub fixMinRaderPrimeFFT: ::std::os::raw::c_int,
    pub fixMaxRaderPrimeFFT: ::std::os::raw::c_int,
    pub inline_rader_g_pow: ::std::os::raw::c_int,
    pub inline_rader_kernel: ::std::os::raw::c_int,
    pub raderRegisters: ::std::os::raw::c_int,
    pub rader_min_registers: ::std::os::raw::c_int,
    pub useRaderFFT: ::std::os::raw::c_int,
    pub performOffsetUpdate: ::std::os::raw::c_int,
    pub performBufferSetUpdate: ::std::os::raw::c_int,
    pub useUint64: ::std::os::raw::c_int,
    pub disableSetLocale: ::std::os::raw::c_int,
    pub regIDs: *mut PfContainer,
    pub regIDs_copy: *mut PfContainer,
    pub temp_conv: *mut PfContainer,
    pub disableThreadsStart: *mut PfContainer,
    pub disableThreadsEnd: *mut PfContainer,
    pub sdataID: PfContainer,
    pub inoutID: PfContainer,
    pub inoutID2: PfContainer,
    pub inoutID_x: PfContainer,
    pub inoutID_y: PfContainer,
    pub combinedID: PfContainer,
    pub LUTId: PfContainer,
    pub raderIDx: PfContainer,
    pub raderIDx2: PfContainer,
    pub offsetImaginaryShared: PfContainer,
    pub gl_LocalInvocationID_x: PfContainer,
    pub gl_LocalInvocationID_y: PfContainer,
    pub gl_LocalInvocationID_z: PfContainer,
    pub gl_GlobalInvocationID_x: PfContainer,
    pub gl_GlobalInvocationID_y: PfContainer,
    pub gl_GlobalInvocationID_z: PfContainer,
    pub gl_SubgroupInvocationID: PfContainer,
    pub gl_SubgroupID: PfContainer,
    pub tshuffle: PfContainer,
    pub sharedStride: PfContainer,
    pub gl_WorkGroupSize_x: PfContainer,
    pub gl_WorkGroupSize_y: PfContainer,
    pub gl_WorkGroupSize_z: PfContainer,
    pub halfDef: PfContainer,
    pub floatDef: PfContainer,
    pub doubleDef: PfContainer,
    pub quadDef: PfContainer,
    pub half2Def: PfContainer,
    pub float2Def: PfContainer,
    pub double2Def: PfContainer,
    pub quad2Def: PfContainer,
    pub halfLiteral: PfContainer,
    pub floatLiteral: PfContainer,
    pub doubleLiteral: PfContainer,
    pub intDef: PfContainer,
    pub uintDef: PfContainer,
    pub int64Def: PfContainer,
    pub uint64Def: PfContainer,
    pub constDef: PfContainer,
    pub functionDef: PfContainer,
    pub gl_WorkGroupID_x: PfContainer,
    pub gl_WorkGroupID_y: PfContainer,
    pub gl_WorkGroupID_z: PfContainer,
    pub workGroupShiftX: PfContainer,
    pub workGroupShiftY: PfContainer,
    pub workGroupShiftZ: PfContainer,
    pub shiftX: PfContainer,
    pub shiftY: PfContainer,
    pub shiftZ: PfContainer,
    pub useDisableThreads: ::std::os::raw::c_int,
    pub __bindgen_padding_7: u64,
    pub disableThreads: PfContainer,
    pub tempReg: PfContainer,
    pub coordinate: PfContainer,
    pub batchID: PfContainer,
    pub stageInvocationID: PfContainer,
    pub blockInvocationID: PfContainer,
    pub temp: PfContainer,
    pub temp2: PfContainer,
    pub tempInt: PfContainer,
    pub tempInt2: PfContainer,
    pub tempFloat: PfContainer,
    pub tempQuad: PfContainer,
    pub tempQuad2: PfContainer,
    pub tempQuad3: PfContainer,
    pub tempIntQuad: PfContainer,
    pub w: PfContainer,
    pub iw: PfContainer,
    pub angle: PfContainer,
    pub mult: PfContainer,
    pub x0: [PfContainer; 33usize],
    pub locID: [PfContainer; 33usize],
    pub code0: *mut ::std::os::raw::c_char,
    pub tempStr: *mut ::std::os::raw::c_char,
    pub tempLen: i64,
    pub currentLen: i64,
    pub currentTempLen: i64,
    pub maxCodeLength: i64,
    pub maxTempLength: i64,
    pub dataTypeSize: ::std::os::raw::c_int,
    pub __bindgen_padding_8: [u64; 0usize],
    pub LFending: PfContainer,
    pub complexDataType: ::std::os::raw::c_int,
    pub floatTypeCode: ::std::os::raw::c_int,
    pub floatTypeKernelMemoryCode: ::std::os::raw::c_int,
    pub floatTypeInputMemoryCode: ::std::os::raw::c_int,
    pub floatTypeOutputMemoryCode: ::std::os::raw::c_int,
    pub vecTypeCode: ::std::os::raw::c_int,
    pub vecTypeKernelMemoryCode: ::std::os::raw::c_int,
    pub vecTypeInputMemoryCode: ::std::os::raw::c_int,
    pub vecTypeOutputMemoryCode: ::std::os::raw::c_int,
    pub intTypeCode: ::std::os::raw::c_int,
    pub uintTypeCode: ::std::os::raw::c_int,
    pub uintType32Code: ::std::os::raw::c_int,
    pub inputMemoryCode: ::std::os::raw::c_int,
    pub outputMemoryCode: ::std::os::raw::c_int,
    pub __bindgen_padding_9: u64,
    pub inputsStruct: PfContainer,
    pub outputsStruct: PfContainer,
    pub kernelStruct: PfContainer,
    pub sdataStruct: PfContainer,
    pub LUTStruct: PfContainer,
    pub BluesteinStruct: PfContainer,
    pub BluesteinConvolutionKernelStruct: PfContainer,
    pub g_powStruct: PfContainer,
    pub oldLocale: PfContainer,
    pub id: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTSpecializationConstantsLayout"]
        [::std::mem::size_of::<VkFFTSpecializationConstantsLayout>() - 15184usize];
    ["Alignment of VkFFTSpecializationConstantsLayout"]
        [::std::mem::align_of::<VkFFTSpecializationConstantsLayout>() - 16usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::res"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, res) - 0usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::double_PI"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, double_PI) - 16usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numFFTdims"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numFFTdims) - 32usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::size"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, size) - 48usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::localSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, localSize) - 240usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numSubgroups"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numSubgroups) - 384usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sourceFFTSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, sourceFFTSize) - 400usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fftDim"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, fftDim) - 448usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::precision"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, precision) - 496usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inverse"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inverse) - 500usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::actualInverse"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, actualInverse) - 504usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inverseBluestein"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inverseBluestein) - 508usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::zeropad"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, zeropad) - 512usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::zeropadBluestein"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, zeropadBluestein) - 520usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::axis_id"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, axis_id) - 528usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::axis_upload_id"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, axis_upload_id) - 532usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numAxisUploads"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numAxisUploads) - 536usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::registers_per_thread"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        registers_per_thread
    ) - 540usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::registers_per_thread_per_radix"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        registers_per_thread_per_radix
    )
        - 544usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::min_registers_per_thread"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        min_registers_per_thread
    ) - 676usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::maxNonPow2Radix"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, maxNonPow2Radix) - 680usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::usedLocRegs"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, usedLocRegs) - 684usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::readToRegisters"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, readToRegisters) - 688usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::writeFromRegisters"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, writeFromRegisters) - 692usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::LUT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, LUT) - 696usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::LUT_4step"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, LUT_4step) - 700usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::raderUintLUT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, raderUintLUT) - 704usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useCoalescedLUTUploadToSM"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        useCoalescedLUTUploadToSM
    )
        - 708usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useBluesteinFFT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, useBluesteinFFT) - 712usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::reverseBluesteinMultiUpload"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        reverseBluesteinMultiUpload
    )
        - 716usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinConvolutionStep"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        BluesteinConvolutionStep
    ) - 720usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinPreMultiplication"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        BluesteinPreMultiplication
    )
        - 724usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinPostMultiplication"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        BluesteinPostMultiplication
    )
        - 728usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::startDCT3LUT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, startDCT3LUT) - 736usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::startDCT4LUT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, startDCT4LUT) - 784usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performR2C"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, performR2C) - 832usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performR2CmultiUpload"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performR2CmultiUpload
    ) - 836usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performR2RmultiUpload"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performR2RmultiUpload
    ) - 840usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performDCT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, performDCT) - 844usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performDST"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, performDST) - 848usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performBandwidthBoost"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performBandwidthBoost
    ) - 852usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::frequencyZeropadding"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        frequencyZeropadding
    ) - 856usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performZeropaddingFull"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performZeropaddingFull
    ) - 860usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performZeropaddingInput"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performZeropaddingInput
    ) - 876usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performZeropaddingOutput"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performZeropaddingOutput
    ) - 892usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_left_full"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_left_full
    ) - 912usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_left_read"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_left_read
    ) - 1104usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_left_write"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_left_write
    ) - 1296usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_right_full"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_right_full
    ) - 1488usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_right_read"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_right_read
    ) - 1680usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_right_write"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_right_write
    ) - 1872usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_Bluestein_left_read"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_Bluestein_left_read
    )
        - 2064usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_Bluestein_left_write"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_Bluestein_left_write
    )
        - 2256usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_Bluestein_right_read"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_Bluestein_right_read
    )
        - 2448usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_zeropad_Bluestein_right_write"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fft_zeropad_Bluestein_right_write
    )
        - 2640usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputStride"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inputStride) - 2832usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputStride"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, outputStride) - 3120usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_dim_full"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, fft_dim_full) - 3408usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::stageStartSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, stageStartSize) - 3456usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::firstStageStartSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        firstStageStartSize
    ) - 3504usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fft_dim_x"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, fft_dim_x) - 3552usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::dispatchZactualFFTSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        dispatchZactualFFTSize
    ) - 3600usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numStages"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numStages) - 3648usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::stageRadix"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, stageRadix) - 3652usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputOffset"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inputOffset) - 3792usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::kernelOffset"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, kernelOffset) - 3840usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputOffset"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, outputOffset) - 3888usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::reorderFourStep"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, reorderFourStep) - 3936usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::storeSharedComplexComponentsSeparately"] [:: std :: mem :: offset_of ! (VkFFTSpecializationConstantsLayout , storeSharedComplexComponentsSeparately) - 3940usize] ;
    ["Offset of field: VkFFTSpecializationConstantsLayout::pushConstantsStructSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        pushConstantsStructSize
    ) - 3944usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performWorkGroupShift"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performWorkGroupShift
    ) - 3948usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performPostCompilationInputOffset"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performPostCompilationInputOffset
    )
        - 3964usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performPostCompilationOutputOffset"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performPostCompilationOutputOffset
    )
        - 3968usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performPostCompilationKernelOffset"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performPostCompilationKernelOffset
    )
        - 3972usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputBufferBlockNum"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        inputBufferBlockNum
    ) - 3976usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputBufferBlockSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        inputBufferBlockSize
    ) - 3984usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputBufferBlockNum"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        outputBufferBlockNum
    ) - 3992usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputBufferBlockSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        outputBufferBlockSize
    ) - 4000usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::kernelBlockNum"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, kernelBlockNum) - 4008usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::kernelBlockSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, kernelBlockSize) - 4016usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numCoordinates"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numCoordinates) - 4024usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::matrixConvolution"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, matrixConvolution) - 4028usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numBatches"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numBatches) - 4032usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numKernels"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numKernels) - 4080usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::conjugateConvolution"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        conjugateConvolution
    ) - 4128usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::crossPowerSpectrumNormalization"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        crossPowerSpectrumNormalization
    )
        - 4132usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::usedSharedMemory"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, usedSharedMemory) - 4144usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedMemSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, sharedMemSize) - 4192usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedMemSizePow2"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, sharedMemSizePow2) - 4196usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::normalize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, normalize) - 4200usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::complexSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, complexSize) - 4204usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputNumberByteSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        inputNumberByteSize
    ) - 4208usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputNumberByteSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        outputNumberByteSize
    ) - 4212usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::kernelNumberByteSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        kernelNumberByteSize
    ) - 4216usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::maxStageSumLUT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, maxStageSumLUT) - 4220usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::swapComputeWorkGroupID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        swapComputeWorkGroupID
    ) - 4224usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::convolutionStep"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, convolutionStep) - 4228usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::symmetricKernel"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, symmetricKernel) - 4232usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::supportAxis"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, supportAxis) - 4236usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::cacheShuffle"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, cacheShuffle) - 4240usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::registerBoost"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, registerBoost) - 4244usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::warpSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, warpSize) - 4248usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numSharedBanks"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numSharedBanks) - 4252usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::resolveBankConflictFirstStages"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        resolveBankConflictFirstStages
    )
        - 4256usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedStrideBankConflictFirstStages"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        sharedStrideBankConflictFirstStages
    )
        - 4272usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedStrideReadWriteConflict"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        sharedStrideReadWriteConflict
    )
        - 4320usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedStrideRaderFFT"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        sharedStrideRaderFFT
    ) - 4368usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedShiftRaderFFT"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        sharedShiftRaderFFT
    ) - 4416usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::maxSharedStride"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, maxSharedStride) - 4464usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::maxSingleSizeStrided"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        maxSingleSizeStrided
    ) - 4512usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::axisSwapped"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, axisSwapped) - 4560usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::stridedSharedLayout"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        stridedSharedLayout
    ) - 4564usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::mergeSequencesR2C"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, mergeSequencesR2C) - 4568usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::forceCallbackVersionRealTransforms"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        forceCallbackVersionRealTransforms
    )
        - 4572usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numBuffersBound"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numBuffersBound) - 4576usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::convolutionBindingID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        convolutionBindingID
    ) - 4616usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::LUTBindingID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, LUTBindingID) - 4620usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinConvolutionBindingID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        BluesteinConvolutionBindingID
    )
        - 4624usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinMultiplicationBindingID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        BluesteinMultiplicationBindingID
    )
        - 4628usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useRader"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, useRader) - 4632usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::numRaderPrimes"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, numRaderPrimes) - 4636usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::minRaderFFTThreadNum"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        minRaderFFTThreadNum
    ) - 4640usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::raderContainer"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, raderContainer) - 4648usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::currentRaderContainer"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        currentRaderContainer
    ) - 4656usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::RaderUintLUTBindingID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        RaderUintLUTBindingID
    ) - 4664usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useRaderMult"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, useRaderMult) - 4668usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::additionalRaderSharedSize"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        additionalRaderSharedSize
    )
        - 4672usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::RaderKernelOffsetShared"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        RaderKernelOffsetShared
    ) - 4720usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::RaderKernelOffsetLUT"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        RaderKernelOffsetLUT
    ) - 6304usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::rader_generator"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, rader_generator) - 7888usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fixMinRaderPrimeMult"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fixMinRaderPrimeMult
    ) - 8020usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fixMaxRaderPrimeMult"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fixMaxRaderPrimeMult
    ) - 8024usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fixMinRaderPrimeFFT"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fixMinRaderPrimeFFT
    ) - 8028usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::fixMaxRaderPrimeFFT"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        fixMaxRaderPrimeFFT
    ) - 8032usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inline_rader_g_pow"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        inline_rader_g_pow
    ) - 8036usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inline_rader_kernel"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        inline_rader_kernel
    ) - 8040usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::raderRegisters"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, raderRegisters) - 8044usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::rader_min_registers"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        rader_min_registers
    ) - 8048usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useRaderFFT"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, useRaderFFT) - 8052usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performOffsetUpdate"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performOffsetUpdate
    ) - 8056usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::performBufferSetUpdate"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        performBufferSetUpdate
    ) - 8060usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useUint64"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, useUint64) - 8064usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::disableSetLocale"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, disableSetLocale) - 8068usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::regIDs"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, regIDs) - 8072usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::regIDs_copy"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, regIDs_copy) - 8080usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::temp_conv"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, temp_conv) - 8088usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::disableThreadsStart"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        disableThreadsStart
    ) - 8096usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::disableThreadsEnd"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, disableThreadsEnd) - 8104usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sdataID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, sdataID) - 8112usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inoutID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inoutID) - 8160usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inoutID2"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inoutID2) - 8208usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inoutID_x"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inoutID_x) - 8256usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inoutID_y"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inoutID_y) - 8304usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::combinedID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, combinedID) - 8352usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::LUTId"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, LUTId) - 8400usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::raderIDx"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, raderIDx) - 8448usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::raderIDx2"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, raderIDx2) - 8496usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::offsetImaginaryShared"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        offsetImaginaryShared
    ) - 8544usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_LocalInvocationID_x"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_LocalInvocationID_x
    ) - 8592usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_LocalInvocationID_y"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_LocalInvocationID_y
    ) - 8640usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_LocalInvocationID_z"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_LocalInvocationID_z
    ) - 8688usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_GlobalInvocationID_x"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_GlobalInvocationID_x
    ) - 8736usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_GlobalInvocationID_y"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_GlobalInvocationID_y
    ) - 8784usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_GlobalInvocationID_z"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_GlobalInvocationID_z
    ) - 8832usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_SubgroupInvocationID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_SubgroupInvocationID
    ) - 8880usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_SubgroupID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, gl_SubgroupID) - 8928usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tshuffle"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tshuffle) - 8976usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sharedStride"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, sharedStride) - 9024usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_WorkGroupSize_x"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_WorkGroupSize_x
    ) - 9072usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_WorkGroupSize_y"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_WorkGroupSize_y
    ) - 9120usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_WorkGroupSize_z"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        gl_WorkGroupSize_z
    ) - 9168usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::halfDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, halfDef) - 9216usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::floatDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, floatDef) - 9264usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::doubleDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, doubleDef) - 9312usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::quadDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, quadDef) - 9360usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::half2Def"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, half2Def) - 9408usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::float2Def"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, float2Def) - 9456usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::double2Def"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, double2Def) - 9504usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::quad2Def"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, quad2Def) - 9552usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::halfLiteral"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, halfLiteral) - 9600usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::floatLiteral"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, floatLiteral) - 9648usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::doubleLiteral"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, doubleLiteral) - 9696usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::intDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, intDef) - 9744usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::uintDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, uintDef) - 9792usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::int64Def"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, int64Def) - 9840usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::uint64Def"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, uint64Def) - 9888usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::constDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, constDef) - 9936usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::functionDef"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, functionDef) - 9984usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_WorkGroupID_x"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, gl_WorkGroupID_x) - 10032usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_WorkGroupID_y"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, gl_WorkGroupID_y) - 10080usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::gl_WorkGroupID_z"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, gl_WorkGroupID_z) - 10128usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::workGroupShiftX"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, workGroupShiftX) - 10176usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::workGroupShiftY"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, workGroupShiftY) - 10224usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::workGroupShiftZ"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, workGroupShiftZ) - 10272usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::shiftX"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, shiftX) - 10320usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::shiftY"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, shiftY) - 10368usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::shiftZ"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, shiftZ) - 10416usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::useDisableThreads"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        useDisableThreads
    ) - 10464usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::disableThreads"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, disableThreads) - 10480usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempReg"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempReg) - 10528usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::coordinate"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, coordinate) - 10576usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::batchID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, batchID) - 10624usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::stageInvocationID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        stageInvocationID
    ) - 10672usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::blockInvocationID"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        blockInvocationID
    ) - 10720usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::temp"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, temp) - 10768usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::temp2"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, temp2) - 10816usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempInt"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempInt) - 10864usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempInt2"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempInt2) - 10912usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempFloat"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempFloat) - 10960usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempQuad"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempQuad) - 11008usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempQuad2"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempQuad2) - 11056usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempQuad3"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempQuad3) - 11104usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempIntQuad"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempIntQuad) - 11152usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::w"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, w) - 11200usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::iw"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, iw) - 11248usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::angle"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, angle) - 11296usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::mult"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, mult) - 11344usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::x0"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, x0) - 11392usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::locID"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, locID) - 12976usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::code0"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, code0) - 14560usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempStr"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempStr) - 14568usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::tempLen"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, tempLen) - 14576usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::currentLen"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, currentLen) - 14584usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::currentTempLen"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, currentTempLen) - 14592usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::maxCodeLength"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, maxCodeLength) - 14600usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::maxTempLength"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, maxTempLength) - 14608usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::dataTypeSize"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, dataTypeSize) - 14616usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::LFending"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, LFending) - 14624usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::complexDataType"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, complexDataType) - 14672usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::floatTypeCode"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, floatTypeCode) - 14676usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::floatTypeKernelMemoryCode"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        floatTypeKernelMemoryCode
    )
        - 14680usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::floatTypeInputMemoryCode"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        floatTypeInputMemoryCode
    )
        - 14684usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::floatTypeOutputMemoryCode"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        floatTypeOutputMemoryCode
    )
        - 14688usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::vecTypeCode"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, vecTypeCode) - 14692usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::vecTypeKernelMemoryCode"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        vecTypeKernelMemoryCode
    )
        - 14696usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::vecTypeInputMemoryCode"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        vecTypeInputMemoryCode
    ) - 14700usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::vecTypeOutputMemoryCode"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        vecTypeOutputMemoryCode
    )
        - 14704usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::intTypeCode"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, intTypeCode) - 14708usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::uintTypeCode"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, uintTypeCode) - 14712usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::uintType32Code"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, uintType32Code) - 14716usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputMemoryCode"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inputMemoryCode) - 14720usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputMemoryCode"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, outputMemoryCode) - 14724usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::inputsStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, inputsStruct) - 14736usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::outputsStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, outputsStruct) - 14784usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::kernelStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, kernelStruct) - 14832usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::sdataStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, sdataStruct) - 14880usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::LUTStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, LUTStruct) - 14928usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, BluesteinStruct) - 14976usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::BluesteinConvolutionKernelStruct"][::std::mem::offset_of!(
        VkFFTSpecializationConstantsLayout,
        BluesteinConvolutionKernelStruct
    )
        - 15024usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::g_powStruct"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, g_powStruct) - 15072usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::oldLocale"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, oldLocale) - 15120usize];
    ["Offset of field: VkFFTSpecializationConstantsLayout::id"]
        [::std::mem::offset_of!(VkFFTSpecializationConstantsLayout, id) - 15168usize];
};
impl Default for VkFFTSpecializationConstantsLayout {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkFFTPushConstantsLayout {
    pub data: [::std::os::raw::c_char; 128usize],
    pub performWorkGroupShift: [u64; 4usize],
    pub workGroupShift: [u64; 4usize],
    pub performPostCompilationInputOffset: u64,
    pub inputOffset: u64,
    pub performPostCompilationOutputOffset: u64,
    pub outputOffset: u64,
    pub performPostCompilationKernelOffset: u64,
    pub kernelOffset: u64,
    pub structSize: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTPushConstantsLayout"]
        [::std::mem::size_of::<VkFFTPushConstantsLayout>() - 248usize];
    ["Alignment of VkFFTPushConstantsLayout"]
        [::std::mem::align_of::<VkFFTPushConstantsLayout>() - 8usize];
    ["Offset of field: VkFFTPushConstantsLayout::data"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, data) - 0usize];
    ["Offset of field: VkFFTPushConstantsLayout::performWorkGroupShift"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, performWorkGroupShift) - 128usize];
    ["Offset of field: VkFFTPushConstantsLayout::workGroupShift"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, workGroupShift) - 160usize];
    ["Offset of field: VkFFTPushConstantsLayout::performPostCompilationInputOffset"][::std::mem::offset_of!(
        VkFFTPushConstantsLayout,
        performPostCompilationInputOffset
    ) - 192usize];
    ["Offset of field: VkFFTPushConstantsLayout::inputOffset"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, inputOffset) - 200usize];
    ["Offset of field: VkFFTPushConstantsLayout::performPostCompilationOutputOffset"][::std::mem::offset_of!(
        VkFFTPushConstantsLayout,
        performPostCompilationOutputOffset
    ) - 208usize];
    ["Offset of field: VkFFTPushConstantsLayout::outputOffset"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, outputOffset) - 216usize];
    ["Offset of field: VkFFTPushConstantsLayout::performPostCompilationKernelOffset"][::std::mem::offset_of!(
        VkFFTPushConstantsLayout,
        performPostCompilationKernelOffset
    ) - 224usize];
    ["Offset of field: VkFFTPushConstantsLayout::kernelOffset"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, kernelOffset) - 232usize];
    ["Offset of field: VkFFTPushConstantsLayout::structSize"]
        [::std::mem::offset_of!(VkFFTPushConstantsLayout, structSize) - 240usize];
};
impl Default for VkFFTPushConstantsLayout {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(16))]
pub struct VkFFTAxis {
    pub numBindings: u64,
    pub axisBlock: [u64; 4usize],
    pub groupedBatch: u64,
    pub specializationConstants: VkFFTSpecializationConstantsLayout,
    pub pushConstants: VkFFTPushConstantsLayout,
    pub updatePushConstants: u64,
    pub VkFFTFunctionName: [::std::os::raw::c_char; 50usize],
    pub inputBuffer: *mut cl_mem,
    pub outputBuffer: *mut cl_mem,
    pub program: cl_program,
    pub kernel: cl_kernel,
    pub bufferLUT: cl_mem,
    pub bufferRaderUintLUT: cl_mem,
    pub bufferBluestein: *mut cl_mem,
    pub bufferBluesteinFFT: *mut cl_mem,
    pub binary: *mut ::std::os::raw::c_void,
    pub binarySize: u64,
    pub bufferLUTSize: u64,
    pub bufferRaderUintLUTSize: u64,
    pub referenceLUT: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTAxis"][::std::mem::size_of::<VkFFTAxis>() - 15648usize];
    ["Alignment of VkFFTAxis"][::std::mem::align_of::<VkFFTAxis>() - 16usize];
    ["Offset of field: VkFFTAxis::numBindings"]
        [::std::mem::offset_of!(VkFFTAxis, numBindings) - 0usize];
    ["Offset of field: VkFFTAxis::axisBlock"]
        [::std::mem::offset_of!(VkFFTAxis, axisBlock) - 8usize];
    ["Offset of field: VkFFTAxis::groupedBatch"]
        [::std::mem::offset_of!(VkFFTAxis, groupedBatch) - 40usize];
    ["Offset of field: VkFFTAxis::specializationConstants"]
        [::std::mem::offset_of!(VkFFTAxis, specializationConstants) - 48usize];
    ["Offset of field: VkFFTAxis::pushConstants"]
        [::std::mem::offset_of!(VkFFTAxis, pushConstants) - 15232usize];
    ["Offset of field: VkFFTAxis::updatePushConstants"]
        [::std::mem::offset_of!(VkFFTAxis, updatePushConstants) - 15480usize];
    ["Offset of field: VkFFTAxis::VkFFTFunctionName"]
        [::std::mem::offset_of!(VkFFTAxis, VkFFTFunctionName) - 15488usize];
    ["Offset of field: VkFFTAxis::inputBuffer"]
        [::std::mem::offset_of!(VkFFTAxis, inputBuffer) - 15544usize];
    ["Offset of field: VkFFTAxis::outputBuffer"]
        [::std::mem::offset_of!(VkFFTAxis, outputBuffer) - 15552usize];
    ["Offset of field: VkFFTAxis::program"]
        [::std::mem::offset_of!(VkFFTAxis, program) - 15560usize];
    ["Offset of field: VkFFTAxis::kernel"][::std::mem::offset_of!(VkFFTAxis, kernel) - 15568usize];
    ["Offset of field: VkFFTAxis::bufferLUT"]
        [::std::mem::offset_of!(VkFFTAxis, bufferLUT) - 15576usize];
    ["Offset of field: VkFFTAxis::bufferRaderUintLUT"]
        [::std::mem::offset_of!(VkFFTAxis, bufferRaderUintLUT) - 15584usize];
    ["Offset of field: VkFFTAxis::bufferBluestein"]
        [::std::mem::offset_of!(VkFFTAxis, bufferBluestein) - 15592usize];
    ["Offset of field: VkFFTAxis::bufferBluesteinFFT"]
        [::std::mem::offset_of!(VkFFTAxis, bufferBluesteinFFT) - 15600usize];
    ["Offset of field: VkFFTAxis::binary"][::std::mem::offset_of!(VkFFTAxis, binary) - 15608usize];
    ["Offset of field: VkFFTAxis::binarySize"]
        [::std::mem::offset_of!(VkFFTAxis, binarySize) - 15616usize];
    ["Offset of field: VkFFTAxis::bufferLUTSize"]
        [::std::mem::offset_of!(VkFFTAxis, bufferLUTSize) - 15624usize];
    ["Offset of field: VkFFTAxis::bufferRaderUintLUTSize"]
        [::std::mem::offset_of!(VkFFTAxis, bufferRaderUintLUTSize) - 15632usize];
    ["Offset of field: VkFFTAxis::referenceLUT"]
        [::std::mem::offset_of!(VkFFTAxis, referenceLUT) - 15640usize];
};
impl Default for VkFFTAxis {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(16))]
pub struct VkFFTPlan {
    pub actualFFTSizePerAxis: [[u64; 4usize]; 4usize],
    pub numAxisUploads: [u64; 4usize],
    pub axisSplit: [[u64; 4usize]; 4usize],
    pub axes: [[VkFFTAxis; 4usize]; 4usize],
    pub bigSequenceEvenR2C: u64,
    pub actualPerformR2CPerAxis: [u64; 4usize],
    pub __bindgen_padding_0: u64,
    pub R2Cdecomposition: VkFFTAxis,
    pub inverseBluesteinAxes: [[VkFFTAxis; 4usize]; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTPlan"][::std::mem::size_of::<VkFFTPlan>() - 516720usize];
    ["Alignment of VkFFTPlan"][::std::mem::align_of::<VkFFTPlan>() - 16usize];
    ["Offset of field: VkFFTPlan::actualFFTSizePerAxis"]
        [::std::mem::offset_of!(VkFFTPlan, actualFFTSizePerAxis) - 0usize];
    ["Offset of field: VkFFTPlan::numAxisUploads"]
        [::std::mem::offset_of!(VkFFTPlan, numAxisUploads) - 128usize];
    ["Offset of field: VkFFTPlan::axisSplit"]
        [::std::mem::offset_of!(VkFFTPlan, axisSplit) - 160usize];
    ["Offset of field: VkFFTPlan::axes"][::std::mem::offset_of!(VkFFTPlan, axes) - 288usize];
    ["Offset of field: VkFFTPlan::bigSequenceEvenR2C"]
        [::std::mem::offset_of!(VkFFTPlan, bigSequenceEvenR2C) - 250656usize];
    ["Offset of field: VkFFTPlan::actualPerformR2CPerAxis"]
        [::std::mem::offset_of!(VkFFTPlan, actualPerformR2CPerAxis) - 250664usize];
    ["Offset of field: VkFFTPlan::R2Cdecomposition"]
        [::std::mem::offset_of!(VkFFTPlan, R2Cdecomposition) - 250704usize];
    ["Offset of field: VkFFTPlan::inverseBluesteinAxes"]
        [::std::mem::offset_of!(VkFFTPlan, inverseBluesteinAxes) - 266352usize];
};
impl Default for VkFFTPlan {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct VkFFTApplication {
    pub configuration: VkFFTConfiguration,
    pub localFFTPlan: *mut VkFFTPlan,
    pub localFFTPlan_inverse: *mut VkFFTPlan,
    pub actualNumBatches: u64,
    pub firstAxis: u64,
    pub lastAxis: u64,
    pub useBluesteinFFT: [u64; 4usize],
    pub bufferRaderUintLUT: [[cl_mem; 4usize]; 4usize],
    pub bufferBluestein: [cl_mem; 4usize],
    pub bufferBluesteinFFT: [cl_mem; 4usize],
    pub bufferBluesteinIFFT: [cl_mem; 4usize],
    pub bufferRaderUintLUTSize: [[u64; 4usize]; 4usize],
    pub bufferBluesteinSize: [u64; 4usize],
    pub applicationBluesteinString: [*mut ::std::os::raw::c_void; 4usize],
    pub applicationBluesteinStringSize: [u64; 4usize],
    pub numRaderFFTPrimes: u64,
    pub rader_primes: [u64; 30usize],
    pub rader_buffer_size: [u64; 30usize],
    pub raderFFTkernel: [*mut ::std::os::raw::c_void; 30usize],
    pub applicationStringOffsetRader: u64,
    pub currentApplicationStringPos: u64,
    pub applicationStringSize: u64,
    pub saveApplicationString: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFFTApplication"][::std::mem::size_of::<VkFFTApplication>() - 2432usize];
    ["Alignment of VkFFTApplication"][::std::mem::align_of::<VkFFTApplication>() - 8usize];
    ["Offset of field: VkFFTApplication::configuration"]
        [::std::mem::offset_of!(VkFFTApplication, configuration) - 0usize];
    ["Offset of field: VkFFTApplication::localFFTPlan"]
        [::std::mem::offset_of!(VkFFTApplication, localFFTPlan) - 1152usize];
    ["Offset of field: VkFFTApplication::localFFTPlan_inverse"]
        [::std::mem::offset_of!(VkFFTApplication, localFFTPlan_inverse) - 1160usize];
    ["Offset of field: VkFFTApplication::actualNumBatches"]
        [::std::mem::offset_of!(VkFFTApplication, actualNumBatches) - 1168usize];
    ["Offset of field: VkFFTApplication::firstAxis"]
        [::std::mem::offset_of!(VkFFTApplication, firstAxis) - 1176usize];
    ["Offset of field: VkFFTApplication::lastAxis"]
        [::std::mem::offset_of!(VkFFTApplication, lastAxis) - 1184usize];
    ["Offset of field: VkFFTApplication::useBluesteinFFT"]
        [::std::mem::offset_of!(VkFFTApplication, useBluesteinFFT) - 1192usize];
    ["Offset of field: VkFFTApplication::bufferRaderUintLUT"]
        [::std::mem::offset_of!(VkFFTApplication, bufferRaderUintLUT) - 1224usize];
    ["Offset of field: VkFFTApplication::bufferBluestein"]
        [::std::mem::offset_of!(VkFFTApplication, bufferBluestein) - 1352usize];
    ["Offset of field: VkFFTApplication::bufferBluesteinFFT"]
        [::std::mem::offset_of!(VkFFTApplication, bufferBluesteinFFT) - 1384usize];
    ["Offset of field: VkFFTApplication::bufferBluesteinIFFT"]
        [::std::mem::offset_of!(VkFFTApplication, bufferBluesteinIFFT) - 1416usize];
    ["Offset of field: VkFFTApplication::bufferRaderUintLUTSize"]
        [::std::mem::offset_of!(VkFFTApplication, bufferRaderUintLUTSize) - 1448usize];
    ["Offset of field: VkFFTApplication::bufferBluesteinSize"]
        [::std::mem::offset_of!(VkFFTApplication, bufferBluesteinSize) - 1576usize];
    ["Offset of field: VkFFTApplication::applicationBluesteinString"]
        [::std::mem::offset_of!(VkFFTApplication, applicationBluesteinString) - 1608usize];
    ["Offset of field: VkFFTApplication::applicationBluesteinStringSize"]
        [::std::mem::offset_of!(VkFFTApplication, applicationBluesteinStringSize) - 1640usize];
    ["Offset of field: VkFFTApplication::numRaderFFTPrimes"]
        [::std::mem::offset_of!(VkFFTApplication, numRaderFFTPrimes) - 1672usize];
    ["Offset of field: VkFFTApplication::rader_primes"]
        [::std::mem::offset_of!(VkFFTApplication, rader_primes) - 1680usize];
    ["Offset of field: VkFFTApplication::rader_buffer_size"]
        [::std::mem::offset_of!(VkFFTApplication, rader_buffer_size) - 1920usize];
    ["Offset of field: VkFFTApplication::raderFFTkernel"]
        [::std::mem::offset_of!(VkFFTApplication, raderFFTkernel) - 2160usize];
    ["Offset of field: VkFFTApplication::applicationStringOffsetRader"]
        [::std::mem::offset_of!(VkFFTApplication, applicationStringOffsetRader) - 2400usize];
    ["Offset of field: VkFFTApplication::currentApplicationStringPos"]
        [::std::mem::offset_of!(VkFFTApplication, currentApplicationStringPos) - 2408usize];
    ["Offset of field: VkFFTApplication::applicationStringSize"]
        [::std::mem::offset_of!(VkFFTApplication, applicationStringSize) - 2416usize];
    ["Offset of field: VkFFTApplication::saveApplicationString"]
        [::std::mem::offset_of!(VkFFTApplication, saveApplicationString) - 2424usize];
};
impl Default for VkFFTApplication {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
